; domain
;; changed from IPC2023 learning version to 2013 version in order for powerlifted parser to work
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/childsnack/domain.pddl
;; updates:
;;   - :equality removed
;;   - :negative-preconditions added
;;   - action move_tray has a new precondition: (not (at ?t ?p2))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; The child-snack domain 2013
;;
;; This domain is for planning how to make and serve sandwiches for a group of
;; children in which some are allergic to gluten. There are two actions for
;; making sandwiches from their ingredients. The first one makes a sandwich and
;; the second one makes a sandwich taking into account that all ingredients are
;; gluten-free. There are also actions to put a sandwich on a tray, to move a tray
;; from one place to another and to serve sandwiches.
;;
;; Problems in this domain define the ingredients to make sandwiches at the initial
;; state. Goals consist of having all kids served with a sandwich to which they
;; are not allergic.
;;
;; Author: Raquel Fuentetaja and Tomás de la Rosa
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(define (domain childsnack)
(:requirements :typing :equality)
(:types child bread-portion content-portion sandwich tray place)
(:constants kitchen - place)

(:predicates (at_kitchen_bread ?b - bread-portion)
	     (at_kitchen_content ?c - content-portion)
     	     (at_kitchen_sandwich ?s - sandwich)
     	     (no_gluten_bread ?b - bread-portion)
       	     (no_gluten_content ?c - content-portion)
      	     (ontray ?s - sandwich ?t - tray)
       	     (no_gluten_sandwich ?s - sandwich)
	     (allergic_gluten ?c - child)
     	     (not_allergic_gluten ?c - child)
	     (served ?c - child)
	     (waiting ?c - child ?p - place)
             (at ?t - tray ?p - place)
	     (notexist ?s - sandwich)
  )

(:action make_sandwich_no_gluten
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and (at_kitchen_bread ?b)
			    (at_kitchen_content ?c)
			    (no_gluten_bread ?b)
			    (no_gluten_content ?c)
			    (notexist ?s))
	 :effect (and
		   (not (at_kitchen_bread ?b))
		   (not (at_kitchen_content ?c))
		   (at_kitchen_sandwich ?s)
		   (no_gluten_sandwich ?s)
                   (not (notexist ?s))
		   ))


(:action make_sandwich
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and (at_kitchen_bread ?b)
			    (at_kitchen_content ?c)
                            (notexist ?s)
			    )
	 :effect (and
		   (not (at_kitchen_bread ?b))
		   (not (at_kitchen_content ?c))
		   (at_kitchen_sandwich ?s)
                   (not (notexist ?s))
		   ))


(:action put_on_tray
	 :parameters (?s - sandwich ?t - tray)
	 :precondition (and  (at_kitchen_sandwich ?s)
			     (at ?t kitchen))
	 :effect (and
		   (not (at_kitchen_sandwich ?s))
		   (ontray ?s ?t)))


(:action serve_sandwich_no_gluten
 	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and
		       (allergic_gluten ?c)
		       (ontray ?s ?t)
		       (waiting ?c ?p)
		       (no_gluten_sandwich ?s)
                       (at ?t ?p)
		       )
	:effect (and (not (ontray ?s ?t))
		     (served ?c)))

(:action serve_sandwich
	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and (not_allergic_gluten ?c)
	                   (waiting ?c ?p)
			   (ontray ?s ?t)
			   (at ?t ?p))
	:effect (and (not (ontray ?s ?t))
		     (served ?c)))

(:action move_tray
	 :parameters (?t - tray ?p1 ?p2 - place)
	 :precondition (and (at ?t ?p1))
	 :effect (and (not (at ?t ?p1))
		      (at ?t ?p2)))


)

; problem
;; children=5, allergic_children=1, trays=1, sandwiches=5, out_folder=training/easy, instance_id=27, seed=55

(define (problem childsnack-27)
 (:domain childsnack)
 (:objects 
    child1 child2 child3 child4 child5 - child
    tray1 - tray
    sandw1 sandw2 sandw3 sandw4 sandw5 - sandwich
    bread1 bread2 bread3 bread4 bread5 - bread-portion
    content1 content2 content3 content4 content5 - content-portion
    table1 table2 table3 - place
    )
 (:init 
    (at tray1 kitchen)
    (at_kitchen_bread bread1)
    (at_kitchen_bread bread2)
    (at_kitchen_bread bread3)
    (at_kitchen_bread bread4)
    (at_kitchen_bread bread5)
    (at_kitchen_content content1)
    (at_kitchen_content content2)
    (at_kitchen_content content3)
    (at_kitchen_content content4)
    (at_kitchen_content content5)
    (allergic_gluten child3)
    (not_allergic_gluten child4)
    (not_allergic_gluten child5)
    (not_allergic_gluten child2)
    (not_allergic_gluten child1)
    (no_gluten_bread bread3)
    (no_gluten_content content1)
    (waiting child3 table2)
    (waiting child4 table3)
    (waiting child5 table2)
    (waiting child2 table2)
    (waiting child1 table3)
    (notexist sandw1)
    (notexist sandw2)
    (notexist sandw3)
    (notexist sandw4)
    (notexist sandw5))
 (:goal  (and (served child1)
   (served child2)
   (served child3)
   (served child4)
   (served child5))))

; plan
1. (make_sandwich_no_gluten sandw1 bread3 content1)
   deleted: (at_kitchen_bread bread3) (at_kitchen_content content1) (notexist sandw1)
   added: (at_kitchen_sandwich sandw1) (no_gluten_sandwich sandw1)
   goals met: 0 of 5
2. (put_on_tray sandw1 tray1)
   deleted: (at_kitchen_sandwich sandw1)
   added: (ontray sandw1 tray1)
   goals met: 0 of 5
3. (make_sandwich sandw2 bread1 content2)
   deleted: (at_kitchen_bread bread1) (at_kitchen_content content2) (notexist sandw2)
   added: (at_kitchen_sandwich sandw2)
   goals met: 0 of 5
4. (put_on_tray sandw2 tray1)
   deleted: (at_kitchen_sandwich sandw2)
   added: (ontray sandw2 tray1)
   goals met: 0 of 5
5. (make_sandwich sandw3 bread2 content3)
   deleted: (at_kitchen_bread bread2) (at_kitchen_content content3) (notexist sandw3)
   added: (at_kitchen_sandwich sandw3)
   goals met: 0 of 5
6. (put_on_tray sandw3 tray1)
   deleted: (at_kitchen_sandwich sandw3)
   added: (ontray sandw3 tray1)
   goals met: 0 of 5
7. (make_sandwich sandw4 bread4 content4)
   deleted: (at_kitchen_bread bread4) (at_kitchen_content content4) (notexist sandw4)
   added: (at_kitchen_sandwich sandw4)
   goals met: 0 of 5
8. (put_on_tray sandw4 tray1)
   deleted: (at_kitchen_sandwich sandw4)
   added: (ontray sandw4 tray1)
   goals met: 0 of 5
9. (make_sandwich sandw5 bread5 content5)
   deleted: (at_kitchen_bread bread5) (at_kitchen_content content5) (notexist sandw5)
   added: (at_kitchen_sandwich sandw5)
   goals met: 0 of 5
10. (put_on_tray sandw5 tray1)
   deleted: (at_kitchen_sandwich sandw5)
   added: (ontray sandw5 tray1)
   goals met: 0 of 5
11. (move_tray tray1 kitchen table2)
   deleted: (at tray1 kitchen)
   added: (at tray1 table2)
   goals met: 0 of 5
12. (serve_sandwich_no_gluten sandw1 child3 tray1 table2)
   deleted: (ontray sandw1 tray1)
   added: (served child3)
   goals met: 1 of 5
13. (serve_sandwich sandw2 child2 tray1 table2)
   deleted: (ontray sandw2 tray1)
   added: (served child2)
   goals met: 2 of 5
14. (serve_sandwich sandw3 child5 tray1 table2)
   deleted: (ontray sandw3 tray1)
   added: (served child5)
   goals met: 3 of 5
15. (move_tray tray1 table2 table3)
   deleted: (at tray1 table2)
   added: (at tray1 table3)
   goals met: 3 of 5
16. (serve_sandwich sandw4 child1 tray1 table3)
   deleted: (ontray sandw4 tray1)
   added: (served child1)
   goals met: 4 of 5
17. (serve_sandwich sandw5 child4 tray1 table3)
   deleted: (ontray sandw5 tray1)
   added: (served child4)
   goals met: 5 of 5
